//
// Created by Administrator on 2024/8/1.
// 差分算法(Diff Algorithm)

#include <stdio.h>

// 1.定义一个数组：
// 2.对数组的2~5部分+3
// 3.对1~6部分-2
// 4.对4~7部分+5
int main() {
    int a[10] = {0};

    // 对数组的2~5部分+3
    a[2] += 3;
    a[5+1] -= 3;

    // 对1~6部分-2
    a[1] += -2;
    a[6+1] -= -2;

    // 对4~7部分+5
    a[4] += 5;
    a[7+1] -= 5;

    // 加工数组，第i个元素的值为前缀和加a[i]，即每一项等于上一项加此项，遍历从1开始
    for (int i=1;i<10;i++) {
        a[i] += a[i-1];
    }

    for (int i=0;i<10;i++)
        printf("%d\n", a[i]);

    return 0;
}

